# a = 'сегодня наш урок начался в ' \
#     '21:30 часов вечера'
# b = a.upper()
# c = a.lower()
# print(c, b)
# z = 'z'
# x = 'x'
# c = 'c'
# q = ('z', 'x' * 5, 'c' * 7)
# print(q)
# a = 'исследователи ESET с()()бщили чт() в насто()ящее время активн()сть' \
#     'xDSpy прекратилась и пр()из()шл() эт() после предупреждения ()публик()ванног()' \
#     'бел()русскими cert в феврале текущег() г()да!' \
#     'П() сути т()гда эксперты ()бнаружили ()дну из вред()н()сных кампаний хакер()в к()т()рая' \
#     'и была детальн() ()писана в д()кументе! именн() инф()рмация бел()руссских cert стала ()тправной т()чк()й ' \
#     'для начала расслед()вания ESET и п()м()гла аналитикам ()бнаружить пр()шлые ()перации XDSpy'
# b = a.replace("()", "о")
# print(b)
# f = 10
# r = 10.5
# j = 13.7
# if r > j:
#     print('r > j')
# elif r < j:
#         print('r < j')
# else:
#     print('r = j')
# a = 4
# b = 7
# if a % 2 == 0:
#     print('число четное')
# elif a % 2 == 1 and a < 4:
#     print('число простое')
# else:
#     print('число нечетное')
# a = 123
# b = 321
# c = a + b
# if c % 2 == 0:
#     print(c / 2)
# elif c / 2 > b:
#     print ('b > sum/2 >a')
# else:
#     print(' ты провалил')